app/controllers/api/v1/group_organizations_controller.rb

      def model_type_prices
        @group_organization = GroupOrganization.where(id: params[:id]).first
        @organizations = Organization.where(group_organization: @group_organization.id).where(org_type:  params[:model_type_name])
        if @organizations.first.present?
---
SELECT  "group_organizations".* FROM "group_organizations" WHERE "group_organizations"."id" = ?  ORDER BY "group_organizations"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."group_organization_id" = 1 AND "organizations"."org_type" = ?  ORDER BY "organizations"."id" ASC LIMIT 1  [["org_type", "Service"]]
SELECT "organizations".* FROM "organizations"