app/controllers/api/v1/locations_controller.rb

      def show
        @group_organization = GroupOrganization.where(id: params[:id]).first
---
SELECT  "group_organizations".* FROM "group_organizations" WHERE "group_organizations"."id" = ?  ORDER BY "group_organizations"."id" ASC LIMIT 1  [["id", 1]]