app/controllers/api/v1/organizations_controller.rb

      def show
        ids = params[:id].split(',')
        @group_organizations = GroupOrganization.where(id: ids)
---
SELECT "group_organizations".* FROM "group_organizations" WHERE "group_organizations"."id" IN (1, 3)
SELECT "organizations".* FROM "organizations" WHERE "organizations"."group_organization_id" = ?  [["group_organization_id", 1]]